ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_SD.cpp
// Copyright Microsoft Corporation
// Copyright GHI Electronics, LLC
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <string.h>

#include "LPC24.h"

#ifdef INCLUDE_SD
//LPC24
#define MCIPower (*(volatile unsigned long *)0xE008C000)
#define MCIPower_OFFSET 0x0
#define MCIPower_Ctrl_MASK 0x3
#define MCIPower_Ctrl_BIT 0
#define MCIPower_OpenDrain_MASK 0x40
#define MCIPower_OpenDrain 0x40
#define MCIPower_OpenDrain_BIT 6
#define MCIPower_Rod_MASK 0x80
#define MCIPower_Rod 0x80
#define MCIPower_Rod_BIT 7

#define MCIClock (*(volatile unsigned long *)0xE008C004)
#define MCIClock_OFFSET 0x4
#define MCIClock_ClkDiv_MASK 0xFF
#define MCIClock_ClkDiv_BIT 0
#define MCIClock_Enable_MASK 0x100
#define MCIClock_Enable 0x100
#define MCIClock_Enable_BIT 8
#define MCIClock_PwrSave_MASK 0x200
#define MCIClock_PwrSave 0x200
#define MCIClock_PwrSave_BIT 9
#define MCIClock_Bypass_MASK 0x400
#define MCIClock_Bypass 0x400
#define MCIClock_Bypass_BIT 10
#define MCIClock_WideBus_MASK 0x800
#define MCIClock_WideBus 0x800
#define MCIClock_WideBus_BIT 11

#define MCIArgument (*(volatile unsigned long *)0xE008C008)
#define MCIArgument_OFFSET 0x8

#define MCICommand (*(volatile unsigned long *)0xE008C00C)
#define MCICommand_OFFSET 0xC
#define MCICommand_CmdIndex_MASK 0x3F
#define MCICommand_CmdIndex_BIT 0
#define MCICommand_Response_MASK 0x40
#define MCICommand_Response 0x40
#define MCICommand_Response_BIT 6
#define MCICommand_LongRsp_MASK 0x80
#define MCICommand_LongRsp 0x80
#define MCICommand_LongRsp_BIT 7
#define MCICommand_Interrupt_MASK 0x100
#define MCICommand_Interrupt 0x100
#define MCICommand_Interrupt_BIT 8
#define MCICommand_Pending_MASK 0x200
#define MCICommand_Pending 0x200
#define MCICommand_Pending_BIT 9
#define MCICommand_Enable_MASK 0x400
#define MCICommand_Enable 0x400
#define MCICommand_Enable_BIT 10

#define MCIRespCmd (*(volatile unsigned long *)0xE008C010)
#define MCIRespCmd_OFFSET 0x10
#define MCIRespCmd_RespCmd_MASK 0x3F
#define MCIRespCmd_RespCmd_BIT 0

#define MCIResponse20 (*(volatile unsigned long *)0xE008C014)
#define MCIResponse20_OFFSET 0x14

#define MCIResponse24 (*(volatile unsigned long *)0xE008C014)
#define MCIResponse24_OFFSET 0x14

#define MCIResponse28 (*(volatile unsigned long *)0xE008C014)
#define MCIResponse28_OFFSET 0x14

#define MCIResponse32 (*(volatile unsigned long *)0xE008C014)
#define MCIResponse32_OFFSET 0x14

#define MCIDataTimer (*(volatile unsigned long *)0xE008C024)
#define MCIDataTimer_OFFSET 0x24

#define MCIDataLength (*(volatile unsigned long *)0xE008C028)
#define MCIDataLength_OFFSET 0x28
#define MCIDataLength_DataLength_MASK 0xFFFF
#define MCIDataLength_DataLength_BIT 0

#define MCIDataCtrl (*(volatile unsigned long *)0xE008C02C)
#define MCIDataCtrl_OFFSET 0x2C
#define MCIDataCtrl_Enable_MASK 0x1
#define MCIDataCtrl_Enable 0x1
#define MCIDataCtrl_Enable_BIT 0
#define MCIDataCtrl_Direction_MASK 0x2
#define MCIDataCtrl_Direction 0x2
#define MCIDataCtrl_Direction_BIT 1
#define MCIDataCtrl_Mode_MASK 0x4
#define MCIDataCtrl_Mode 0x4
#define MCIDataCtrl_Mode_BIT 2
#define MCIDataCtrl_DMAEnable_MASK 0x8
#define MCIDataCtrl_DMAEnable 0x8
#define MCIDataCtrl_DMAEnable_BIT 3
#define MCIDataCtrl_BlockSize_MASK 0xF0
#define MCIDataCtrl_BlockSize_BIT 4

#define MCIDataCnt (*(volatile unsigned long *)0xE008C030)
#define MCIDataCnt_OFFSET 0x30
#define MCIDataCnt_DataCount_MASK 0xFFFF
#define MCIDataCnt_DataCount_BIT 0

#define MCIStatus (*(volatile unsigned long *)0xE008C034)
#define MCIStatus_OFFSET 0x34
#define MCIStatus_CmdCrcFail_MASK 0x1
#define MCIStatus_CmdCrcFail 0x1
#define MCIStatus_CmdCrcFail_BIT 0
#define MCIStatus_DataCrcFail_MASK 0x2
#define MCIStatus_DataCrcFail 0x2
#define MCIStatus_DataCrcFail_BIT 1
#define MCIStatus_CmdTimeOut_MASK 0x4
#define MCIStatus_CmdTimeOut 0x4
#define MCIStatus_CmdTimeOut_BIT 2
#define MCIStatus_DataTimeOut_MASK 0x8
#define MCIStatus_DataTimeOut 0x8
#define MCIStatus_DataTimeOut_BIT 3
#define MCIStatus_TxUnderrun_MASK 0x10
#define MCIStatus_TxUnderrun 0x10
#define MCIStatus_TxUnderrun_BIT 4
#define MCIStatus_RxOverrun_MASK 0x20
#define MCIStatus_RxOverrun 0x20
#define MCIStatus_RxOverrun_BIT 5
#define MCIStatus_CmdRespEnd_MASK 0x40
#define MCIStatus_CmdRespEnd 0x40
#define MCIStatus_CmdRespEnd_BIT 6
#define MCIStatus_CmdSent_MASK 0x80
#define MCIStatus_CmdSent 0x80
#define MCIStatus_CmdSent_BIT 7
#define MCIStatus_DataEnd_MASK 0x100
#define MCIStatus_DataEnd 0x100
#define MCIStatus_DataEnd_BIT 8
#define MCIStatus_StartBitErr_MASK 0x200
#define MCIStatus_StartBitErr 0x200
#define MCIStatus_StartBitErr_BIT 9
#define MCIStatus_DataBlockEnd_MASK 0x400
#define MCIStatus_DataBlockEnd 0x400
#define MCIStatus_DataBlockEnd_BIT 10
#define MCIStatus_CmdActive_MASK 0x800
#define MCIStatus_CmdActive 0x800
#define MCIStatus_CmdActive_BIT 11
#define MCIStatus_TxActive_MASK 0x1000
#define MCIStatus_TxActive 0x1000
#define MCIStatus_TxActive_BIT 12
#define MCIStatus_RxActive_MASK 0x2000
#define MCIStatus_RxActive 0x2000
#define MCIStatus_RxActive_BIT 13
#define MCIStatus_TxFifoHalfEmpty_MASK 0x4000
#define MCIStatus_TxFifoHalfEmpty 0x4000
#define MCIStatus_TxFifoHalfEmpty_BIT 14
#define MCIStatus_RxFifoHalfEmpty_MASK 0x8000
#define MCIStatus_RxFifoHalfEmpty 0x8000
#define MCIStatus_RxFifoHalfEmpty_BIT 15
#define MCIStatus_TxFifoFull_MASK 0x10000
#define MCIStatus_TxFifoFull 0x10000
#define MCIStatus_TxFifoFull_BIT 16
#define MCIStatus_RxFifoFull_MASK 0x20000
#define MCIStatus_RxFifoFull 0x20000
#define MCIStatus_RxFifoFull_BIT 17
#define MCIStatus_TxFifoEmpty_MASK 0x40000
#define MCIStatus_TxFifoEmpty 0x40000
#define MCIStatus_TxFifoEmpty_BIT 18
#define MCIStatus_RxFifoEmpty_MASK 0x80000
#define MCIStatus_RxFifoEmpty 0x80000
#define MCIStatus_RxFifoEmpty_BIT 19
#define MCIStatus_TxDataAvlbl_MASK 0x100000
#define MCIStatus_TxDataAvlbl 0x100000
#define MCIStatus_TxDataAvlbl_BIT 20
#define MCIStatus_RxDataAvlbl_MASK 0x200000
#define MCIStatus_RxDataAvlbl 0x200000
#define MCIStatus_RxDataAvlbl_BIT 21

#define MCIClear (*(volatile unsigned long *)0xE008C038)
#define MCIClear_OFFSET 0x38
#define MCIClear_CmdCrcFailClr_MASK 0x1
#define MCIClear_CmdCrcFailClr 0x1
#define MCIClear_CmdCrcFailClr_BIT 0
#define MCIClear_DataCrcFailClr_MASK 0x2
#define MCIClear_DataCrcFailClr 0x2
#define MCIClear_DataCrcFailClr_BIT 1
#define MCIClear_CmdTimeOutClr_MASK 0x4
#define MCIClear_CmdTimeOutClr 0x4
#define MCIClear_CmdTimeOutClr_BIT 2
#define MCIClear_DataTimeOutClr_MASK 0x8
#define MCIClear_DataTimeOutClr 0x8
#define MCIClear_DataTimeOutClr_BIT 3
#define MCIClear_TxUnderrunClr_MASK 0x10
#define MCIClear_TxUnderrunClr 0x10
#define MCIClear_TxUnderrunClr_BIT 4
#define MCIClear_RxOverrunClr_MASK 0x20
#define MCIClear_RxOverrunClr 0x20
#define MCIClear_RxOverrunClr_BIT 5
#define MCIClear_CmdRespEndClr_MASK 0x40
#define MCIClear_CmdRespEndClr 0x40
#define MCIClear_CmdRespEndClr_BIT 6
#define MCIClear_CmdSentClr_MASK 0x80
#define MCIClear_CmdSentClr 0x80
#define MCIClear_CmdSentClr_BIT 7
#define MCIClear_DataEndClr_MASK 0x100
#define MCIClear_DataEndClr 0x100
#define MCIClear_DataEndClr_BIT 8
#define MCIClear_StartBitErrClr_MASK 0x200
#define MCIClear_StartBitErrClr 0x200
#define MCIClear_StartBitErrClr_BIT 9
#define MCIClear_DataBlockEndClr_MASK 0x400
#define MCIClear_DataBlockEndClr 0x400
#define MCIClear_DataBlockEndClr_BIT 10

#define MCIMask0 (*(volatile unsigned long *)0xE008C03C)
#define MCIMask0_OFFSET 0x3C

#define MCIMask1 (*(volatile unsigned long *)0xE008C040)
#define MCIMask1_OFFSET 0x40

