ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_SD.cpp
        }
        MCI_Block_End_Flag = 0;

        return;
    }

    /* Tx active  */
    if (MCIStatus & MCI_TX_ACTIVE) {
        DataTxActiveCount++;
    }
    /* Rx active  */
    if (MCIStatus & MCI_RX_ACTIVE) {
        DataRxActiveCount++;
    }
    return;
}

/******************************************************************************
** Function name:    MCI_FIFOInterruptService
**
** Descriptions:    Called by MCI interrupt handler when using FIFO
**                    interrupts and DMA is disabled
**
**
** parameters:            None
** Returned value:        None
**
******************************************************************************/
void MCI_FIFOInterruptService(void) {
    DataFIFOCount++;
}

/******************************************************************************
** Function name:        MCI_IRQHandler
**
** Descriptions:        MCI interrupt handler
**                        The handler to handle the block data write and read
**                        not for the commands.
**
** parameters:            None
** Returned value:        None
**
******************************************************************************/
void MCI_IRQHandler(void * p) {
    uint32_t MCI_Status;

    MCI_Status = MCIStatus;

    /* handle MCIStatus interrupt */
    if (MCI_Status & DATA_ERR_INT_MASK) {
        MCI_DataErrorProcess();
        MCI_DataErrorProcess_count++;
        //VICVectAddr = 0;        /* Acknowledge Interrupt */
        return;
    }
    if (MCI_Status & DATA_END_INT_MASK) {
        MCI_DATA_END_InterruptService();
        MCI_DATA_END_InterruptService_count++;
        return;
    }
    else if (MCI_Status & FIFO_INT_MASK) {
        MCI_FIFOInterruptService();
        MCI_FIFOInterruptService_count++;
        return;
    }
    else if (MCI_Status & CMD_INT_MASK) {
        MCI_CmdProcess();
        MCI_CmdProcess_count++;
        return;
    }
    return;
}

/******************************************************************************
** Function name:        MCI_Set_MCIClock
**
** Descriptions:        Set MCI clock rate, during initialization phase < 400K
**                        during data phase < 20Mhz.
**
** parameters:            Clock rate to be set
** Returned value:        None
**
******************************************************************************/
void MCI_Set_MCIClock(uint32_t ClockRate) {
    uint32_t i, ClkValue = 0;

    ClkValue |= ClockRate;/* normal MMC clock */

    MCI_CLOCK &= ~(0xFF); /* clear clock divider */
    MCI_CLOCK |= (1 << 8) | ClkValue | (1 << 9);

    LPC24_Time_Delay(nullptr, 1 * 1000);
}

/******************************************************************************
** Function name:        SD_Set_BusWidth
**
** Descriptions:        1-bit bus or 4-bit bus.
**
** parameters:            bus width
** Returned value:        true or false
**
******************************************************************************/
bool SD_Set_BusWidth(uint32_t width) {
    uint32_t i;

    for (i = 0; i < 0x10; i++);    /* delay 3MCLK + 2PCLK  */

    if (width == SD_1_BIT) {
        MCI_CLOCK &= ~(1 << 11);    /* 1 bit bus */
        if (MCI_Send_ACMD_Bus_Width(BUS_WIDTH_1BIT) == false) {
            return(false);
        }
    }
    else if (width == SD_4_BIT) {
        MCI_CLOCK |= (1 << 11);/* 4 bit bus */
        if (MCI_Send_ACMD_Bus_Width(BUS_WIDTH_4BITS) == false) {
            return(false);
        }
    }


    return true;
}

/******************************************************************************
** Function name:        MCI_Init
**
** Descriptions:        Set MCI clock and power registers, setup VIC for
**                        data interrupt.
**
** parameters:            None
** Returned value:        true or fase, if VIC table is full, return false
**
******************************************************************************/
void MCI_Init(void) {
    volatile uint32_t i;

    LPC24_Time_Delay(nullptr, 50 * 1000); // delay 50ms


    LPC24XX::SYSCON().PCONP |= (1 << 28);            /* Enable clock to the MCI block */




    if (MCI_CLOCK & (1 << 8)) {
        MCI_CLOCK &= ~(1 << 8);
    }

    if (MCI_POWER & 0x02) {
        MCI_POWER = 0x00;
    }

    LPC24_Time_Delay(nullptr, 1000); // delay 1ms

    /* Disable all interrupts for now */
    MCI_MASK0 = 0;

    LPC24XX::SYSCON().SCS |= 0x08;

    //Setting for timeout problem
    MCI_DATA_TMR = 0x1FFFFFFF;

    /*set up clocking default mode, clear any registers as needed */
    MCI_COMMAND = 0;
    MCI_DATA_CTRL = 0;
    MCI_CLEAR = 0x7FF;

    MCI_POWER = 0x02;

    while (!(MCI_POWER & 0x02));

    LPC24_Time_Delay(nullptr, 1000); // delay 1ms

    MCI_Set_MCIClock(MCI_CLK_300KHZ);

    LPC24_Time_Delay(nullptr, 1000); // delay 1ms

    MCI_POWER |= 0x01;

    LPC24_Time_Delay(nullptr, 2000); // delay 2ms

    LPC24_Interrupt_Activate(LPC24XX_VIC::c_IRQ_INDEX_SD, (uint32_t*)&MCI_IRQHandler, (void*)0);
}

/******************************************************************************
** Function name:        MCI_SendCmd
**
** Descriptions:        The routine is used to send a CMD to the card
**
** parameters:            CmdIndex, Argument, ExpectResp Flag, AllowTimeout flag
** Returned value:        None
**
******************************************************************************/
void MCI_SendCmd(uint32_t CmdIndex, uint32_t Argument, uint32_t ExpectResp, uint32_t AllowTimeout) {
    uint32_t i, CmdData = 0;
    uint32_t CmdStatus;

    while ((CmdStatus = MCI_STATUS) & MCI_CMD_ACTIVE)    /* Command in progress. */
    {
        MCI_COMMAND = 0;
        MCI_CLEAR = CmdStatus | MCI_CMD_ACTIVE;
    }

    /*set the command details, the CmdIndex should 0 through 0x3F only */
    CmdData |= (CmdIndex & 0x3F);    /* bit 0 through 5 only */
    if (ExpectResp == EXPECT_NO_RESP)            /* no response */
    {
        CmdData &= ~((1 << 6) | (1 << 7));        /* Clear long response bit as well */
    }
    else if (ExpectResp == EXPECT_SHORT_RESP)    /* expect short response */
    {
        CmdData |= (1 << 6);
    }
    else if (ExpectResp == EXPECT_LONG_RESP)    /* expect long response */
    {
        CmdData |= (1 << 6) | (1 << 7);
    }

    if (AllowTimeout)            /* allow timeout or not */
    {
        CmdData |= (1 << 8);
    }
    else {
        CmdData &= ~(1 << 8);
    }

    /*send the command*/
    CmdData |= (1 << 10);        /* This bit needs to be set last. */
    MCI_ARGUMENT = Argument;    /* Set the argument first, finally command */
    MCI_COMMAND = CmdData;
}

