ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_SD.cpp
        retryCount--;
    }

    return(false);
}

/******************************************************************************
** Function name:        MCI_Send_ACMD_OP_Cond
**
** Descriptions:        If Send_OP_Cond is timeout, it's not a MMC card, try
**                        this combination to see if we can communicate with
**                        a SD card.
**
** parameters:            None
** Returned value:        true or false, true if card has been initialized.
**
******************************************************************************/
uint32_t MCI_Send_ACMD_OP_Cond(void) {
    uint32_t i, retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];

    retryCount = ACMD_OP_COND_COUNT;

    while (retryCount > 0) {
        MCI_POWER &= ~(1 << 6);

        LPC24_Time_Delay(nullptr, 15000);

        if (MCI_Send_ACMD() == false) {
            retryCount--;

            continue;
        }

        /* Send ACMD41 command repeatedly until the response is back correctly */
        MCI_SendCmd(SEND_APP_OP_COND, OCR_INDEX, EXPECT_SHORT_RESP, 0);
        respStatus = MCI_GetCmdResp(SEND_APP_OP_COND, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);

        if (!(respStatus & MCI_CMD_TIMEOUT) && (respValue[0] & 0x80000000)) {
            return (true);    /* response is back and correct. */
        }

        LPC24_Time_Delay(nullptr, 1000); // delay 1ms

        retryCount--;
    }
    return(false);
}



uint32_t MCI_Send_SDHC(void) {
    uint32_t i, retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];

    MCI_SendCmd(8, 0x1aa, EXPECT_SHORT_RESP, 0);
    respStatus = MCI_GetCmdResp(8, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);
    if (respStatus) {
        return (false);
    }

    retryCount = ACMD_OP_COND_COUNT;
    MCI_POWER &= ~(1 << 6);

    LPC24_Time_Delay(nullptr, 1000); // delay 1ms

    while (retryCount > 0) {


        if (MCI_Send_ACMD() == false) {
            retryCount--;
            continue;
        }

        /* Send ACMD41 command repeatedly until the response is back correctly */
        MCI_SendCmd(SEND_APP_OP_COND, OCR_INDEX | 1 << 30, EXPECT_SHORT_RESP, 0);
        respStatus = MCI_GetCmdResp(SEND_APP_OP_COND, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);
        if (!(respStatus & MCI_CMD_TIMEOUT) && (respValue[0] & 0x80000000)) {
            if (respValue[0] & 0x40000000)
                isSDHC = true;
            return (true);
        }
        LPC24_Time_Delay(nullptr, 1000); // delay 1ms
        retryCount--;
    }
    return(false);
}

/******************************************************************************
** Function name:        MCI_CardInit
**
** Descriptions:        Try CMD1 first for MMC, if it's timeout, try CMD55
**                        and CMD41 for SD, if both failed, initialization faliure,
**                        bailout with unknown card type. Otherwise, return the
**                        card type, either MMC or SD.
**
** parameters:            None
** Returned value:        Card type.
**
******************************************************************************/
uint32_t MCI_CardInit(void) {
    uint32_t i, CardType;

    isSDHC = false;

    MCI_CardType = CARD_UNKNOWN;

    if (MCI_Go_Idle_State() == false) {
        return(CARD_UNKNOWN);
    }

    MCI_POWER &= ~(1 << 6);

    LPC24_Time_Delay(nullptr, 1000); // delay 1ms

    if (MCI_Send_SDHC() == true) {

        CardType = SD_CARD;
        return (CardType);
    }
    else if (MCI_Send_ACMD_OP_Cond() == true) {
        CardType = SD_CARD;
        return (CardType);
    }

    MCI_POWER |= (1 << 6);

    if (MCI_Send_OP_Cond() == true) {
        CardType = MMC_CARD;
        MCI_POWER &= ~(1 << 6);

        LPC24_Time_Delay(nullptr, 1000); // delay 1ms

        return (CardType);
    }

    return (CARD_UNKNOWN);
}

/******************************************************************************
** Function name:        MCI_Check_CID
**
** Descriptions:        Send CMD2, ALL_SEND_CID
**
** parameters:            None
** Returned value:        If not timeout, return true.
**
******************************************************************************/
bool MCI_Check_CID(void) {
    uint32_t i, retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];


    retryCount = 0x20;
    while (retryCount > 0) {
        /* Send CMD2 command repeatedly until the response is back correctly */
        MCI_SendCmd(ALL_SEND_CID, 0, EXPECT_LONG_RESP, 0);
        respStatus = MCI_GetCmdResp(ALL_SEND_CID, EXPECT_LONG_RESP, (uint32_t *)&respValue[0]);

        /* bit 0 and bit 2 must be zero, or it's timeout or CRC error */
        if (!(respStatus & MCI_CMD_TIMEOUT)) {
            return (true);
        }

        LPC24_Time_Delay(nullptr, 1000);
        retryCount--;
    }
    return (false);
}

/******************************************************************************
** Function name:        MCI_Set_Address
**
** Descriptions:        Send CMD3, STE_RELATIVE_ADDR, should after CMD2
**
** parameters:            None
** Returned value:        true if response is back before timeout.
**
******************************************************************************/
bool MCI_Set_Address(void) {
    uint32_t i, retryCount;
    uint32_t respStatus;
    uint32_t respValue[4];
    uint32_t CmdArgument;

    if (MCI_CardType == SD_CARD) {
        CmdArgument = 0;
    }
    else {
        CmdArgument = 0x00010000;
    }

    retryCount = 0x20;
    while (retryCount > 0) {
        /* Send CMD3 command repeatedly until the response is back correctly */
        MCI_SendCmd(SET_RELATIVE_ADDR, CmdArgument, EXPECT_SHORT_RESP, 0);
        respStatus = MCI_GetCmdResp(SET_RELATIVE_ADDR, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);

        if (!(respStatus & MCI_CMD_TIMEOUT) && ((respValue[0] & (0x0F << 8)) == 0x0500)) {
            CardRCA = respValue[0] & 0xFFFF0000;
            return (true);
        }

        LPC24_Time_Delay(nullptr, 1000);
        retryCount--;
    }
    return (false);
}

