ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_SD.cpp
    MCI_CLEAR = 0x7FF;
    MCI_DATA_CTRL = 0;

    if (MCI_CheckStatus() != true) {
        MCI_Send_Stop();
        return(false);
    }

    MCI_DATA_TMR = DATA_TIMER_VALUE;
    MCI_DATA_LEN = BLOCK_LENGTH;
    MCI_Block_End_Flag = 1;

    MCI_DATA_END_Callback = Write_end_Callback;

    MCI_TXEnable();
    if (MCI_Send_Write_Block(blockNum) == false) {
        return (false);
    }

    DMA_Move(0, M2P);
    GPDMA_CH0_CFG = 0x10001 | (0x00 << 1) | (0x04 << 6) | (0x05 << 11);
    DataCtrl = ((1 << 0) | (1 << 3) | (DATA_BLOCK_LEN << 4));

    MCI_DATA_CTRL = DataCtrl;

    return (true);
}

/******************************************************************************
** Function name:        MCI_Read_Block
**
** Descriptions:        Set MCI data control register, data length and data
**                        timeout, send READ_SINGLE_BLOCK cmd, finally, enable
**                        interrupt. On completion of READ_SINGLE_BLOCK cmd,
**                        RX_ACTIVE interrupt will occurs, data can be read
**                        continuously into the FIFO until the block data
**                        length is reached.
**
** parameters:            block number
** Returned value:        true or false, if cmd times out, return false and no
**                        need to continue.
**
**
******************************************************************************/
bool MCI_Read_Block(uint32_t blockNum, MCI_DATA_END_CALLBACK read_end_Callback) {
    uint32_t i;
    uint32_t DataCtrl = 0;

    MCI_CLEAR = 0x7FF;
    MCI_DATA_CTRL = 0;

    if (MCI_CheckStatus() != true) {

        MCI_Send_Stop();
        return(false);
    }
    MCI_RXEnable();

    MCI_DATA_TMR = DATA_TIMER_VALUE;
    MCI_DATA_LEN = BLOCK_LENGTH;
    MCI_Block_End_Flag = 1;

    MCI_DATA_END_Callback = read_end_Callback;

    if (MCI_Send_Read_Block(blockNum) == false) {
        return (false);
    }

    DMA_Move(0, P2M);
    GPDMA_CH0_CFG = 0x10001 | (0x04 << 1) | (0x00 << 6) | (0x06 << 11);
    DataCtrl = ((1 << 0) | (1 << 1) | (1 << 3) | (DATA_BLOCK_LEN << 4));

    MCI_DATA_CTRL = DataCtrl;

    return (true);
}

/******************************************************************************
** Function name:        MCI_And_Card_initialize
**
** Descriptions:        Intialize Memory Card Interface and then Initialize Card
**
**
** parameters:            None
** Returned value:        false if succeeded. Nuber  if Faild
**
******************************************************************************/
bool MCI_And_Card_initialize(void) {
    int err = 0;
    sdMediaSize = 0;
    sdSectorsPerBlock = 0;

    DMA_Init();

    MCI_Init();

    // Allow the card to power up...
    LPC24_Time_Delay(nullptr, 50 * 1000); // delay 50ms

    if (!err) {
        MCI_CardType = MCI_CardInit();
        if (MCI_CardType == CARD_UNKNOWN) {
            err++;
        }
    }

    if (err || MCI_Check_CID() == false) {
        err++;
    }

    if (err || MCI_Set_Address() == false) {
        err++;
    }

    if (err || MCI_Send_CSD() == false) {

        err++;
    }
    if (err || MCI_Select_Card() == false) {

        err++;
    }

    if (!err) {
        MCI_Set_MCIClock(MCI_CLK_9MHz_DEFAULT);

        if (MCI_CardType == SD_CARD) {

            if (SD_Set_BusWidth(SD_4_BIT) != true) {
                err++;
            }
        }
        else {
            MCI_CLOCK &= ~(1 << 11);
        }
    }

    if (err || MCI_Set_BlockLen(BLOCK_LENGTH) == false) {
        err++;
    }

    return err == 0 ? true : false;
}

/******************************************************************************
** Function name:        MCI_ReadSector
**
** parameters:            block number, Read Buffer
** Returned value:        false if Succeeded
**
**
******************************************************************************/
volatile uint8_t Read_Flag = 0;

void Read_end_Callback() {
    Read_Flag = 1;
}

bool MCI_ReadSector(
    uint32_t sector,
    uint8_t *buff) {
    uint32_t i;
    uint8_t temp;

    ReadBlock = (uint8_t *)(DMA_DST);

    if (MCI_Read_Block(sector, Read_end_Callback) == false) {
        return false; // Error
    }

    temp = 0;
    i = 0;
    while (i < READ_TIME_OUT) {
        if (Read_Flag == 1) {
            temp = 1;
            break;
        }

        i++;
        LPC24_Time_Delay(nullptr, 1000); // READ_TIME_OUT uint is ms;
    }
    Read_Flag = 0;

    if (temp == 0)
        return false; // Error

    memcpy(buff, ReadBlock, BLOCK_LENGTH);

    return true;// No Error
}

/******************************************************************************
** Function name:        MCI_WriteSector
**
** parameters:            block number, Write Buffer
** Returned value:        false if Succeeded
**
**
******************************************************************************/

volatile uint8_t Flag_write = 0;

void Write_end_Callback() {
    Flag_write = 1;
}

bool MCI_WriteSector(
    uint32_t sector,        /* Sector number (LBA) */
    uint8_t *buff    /* Data to be written */) {
    uint32_t i;
    uint8_t temp;

    WriteBlock = (uint8_t *)(DMA_SRC);
    memcpy(WriteBlock, buff, BLOCK_LENGTH);


    if (MCI_Write_Block(sector, Write_end_Callback) == false) {
        /* Fatal error */
        return false; // Error
    }

    temp = 0;
    i = 0;

    while (i < WRITE_TIME_OUT) {
        if (Flag_write == 1) {
            temp = 1;
            break;
        }

        i++;
        LPC24_Time_Delay(nullptr, 1000); // WRITE_TIME_OUT unit is ms = 1000*x;
    }

    Flag_write = 0;

    if (temp == 0)
        return false; // Error

    return true;// No Error
}

/************************************************************************//**
 * @brief         Send CMD8 (SEND_IF_COND) for interface condition to card.
 *
 * @param        None
 *
 * @return         MCI_FUNC_OK if all success
 ****************************************************************************/
int32_t MCI_Cmd_SendIfCond(void) {
    volatile uint32_t i;
    uint32_t retryCount;
    uint32_t CmdArgument;
    uint32_t respStatus;
    uint32_t respValue[4];

    int32_t retval = MCI_FUNC_FAILED;

    uint8_t voltageSupplied = 0x01;//in range 2.7-3.6V
    uint8_t checkPattern = 0xAA;

    CmdArgument = (voltageSupplied << 8 /* Voltage Supplied Bit*/) | checkPattern;

    retryCount = 20;

