ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_SD.cpp
    while (retryCount > 0) {

        MCI_SendCmd(SEND_IF_COND, CmdArgument, EXPECT_SHORT_RESP, 1/*Allow a command timeout*/);
        respStatus = MCI_GetCmdResp(SEND_IF_COND, EXPECT_SHORT_RESP, (uint32_t *)&respValue[0]);

        if (respStatus & MCI_CMD_TIMEOUT) {
            //Consider as no response
            retval = MCI_FUNC_TIMEOUT;
        }
        else if ((respValue[0] & 0xFF /*Checkerpattern Bit Mask*/) != checkPattern) {
            retval = MCI_FUNC_FAILED;
        }
        else if (((respValue[0] >> 8 /* Voltage Supplied Bit*/) & 0xFF/* Voltage Supplied Bit Mask*/)
            != voltageSupplied) {
            retval = MCI_FUNC_BAD_PARAMETERS;
        }
        else {
            retval = MCI_FUNC_OK;
            break;
        }

        LPC24_Time_Delay(nullptr, 1000); // delay 1ms

        retryCount--;
    }

    return retval;
}

// LPC24
#define LPC24_SD_SECTOR_SIZE 512
#define LPC24_SD_TIMEOUT 5000000
#define TOTAL_SDCARD_CONTROLLERS 1

static TinyCLR_Storage_Controller sdCardControllers[TOTAL_SDCARD_CONTROLLERS];
static TinyCLR_Api_Info sdCardApi[TOTAL_SDCARD_CONTROLLERS];

struct SdCardState {
    int32_t controllerIndex;
    size_t  sectorCount;

    size_t  *sectorSizes;
};

static const LPC24_Gpio_Pin sdCardData0Pins[] = LPC24_SD_DATA0_PINS;
static const LPC24_Gpio_Pin sdCardData1Pins[] = LPC24_SD_DATA1_PINS;
static const LPC24_Gpio_Pin sdCardData2Pins[] = LPC24_SD_DATA2_PINS;
static const LPC24_Gpio_Pin sdCardData3Pins[] = LPC24_SD_DATA3_PINS;
static const LPC24_Gpio_Pin sdCardClkPins[] = LPC24_SD_CLK_PINS;
static const LPC24_Gpio_Pin sdCardCmdPins[] = LPC24_SD_CMD_PINS;

static SdCardState sdCardStates[TOTAL_SDCARD_CONTROLLERS];

const TinyCLR_Api_Info* LPC24_SdCard_GetApi() {
    for (auto i = 0; i < TOTAL_SDCARD_CONTROLLERS; i++) {
        sdCardControllers[i].ApiInfo = &sdCardApi[i];

        sdCardControllers[i].Acquire = &LPC24_SdCard_Acquire;
        sdCardControllers[i].Release = &LPC24_SdCard_Release;

        sdCardControllers[i].WriteSectors = &LPC24_SdCard_WriteSectors;
        sdCardControllers[i].ReadSectors = &LPC24_SdCard_ReadSectors;
        sdCardControllers[i].EraseSectors = &LPC24_SdCard_EraseSectors;
        sdCardControllers[i].IsSectorErased = &LPC24_SdCard_IsSectorErased;
        sdCardControllers[i].GetSectorMap = &LPC24_SdCard_GetSectorMap;

        sdCardApi[i].Author = "GHI Electronics, LLC";
        sdCardApi[i].Name = "GHIElectronics.TinyCLR.NativeApis.LPC24.SdCardController";
        sdCardApi[i].Type = TinyCLR_Api_Type::SdCardController;
        sdCardApi[i].Version = 0;
        sdCardApi[i].Implementation = &sdCardControllers[i];
        sdCardApi[i].State = &sdCardStates[i];

        sdCardStates[i].controllerIndex = i;
    }

    return (const TinyCLR_Api_Info*)&sdCardApi;
}

TinyCLR_Result LPC24_SdCard_Acquire(const TinyCLR_Storage_Controller* self) {
    auto state = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    auto controllerIndex = state->controllerIndex;

    auto d0 = sdCardData0Pins[controllerIndex];
    auto d1 = sdCardData1Pins[controllerIndex];
    auto d2 = sdCardData2Pins[controllerIndex];
    auto d3 = sdCardData3Pins[controllerIndex];
    auto clk = sdCardClkPins[controllerIndex];
    auto cmd = sdCardCmdPins[controllerIndex];

    if (!LPC24_Gpio_OpenPin(d0.number)
        || !LPC24_Gpio_OpenPin(d1.number)
        || !LPC24_Gpio_OpenPin(d2.number)
        || !LPC24_Gpio_OpenPin(d3.number)
        || !LPC24_Gpio_OpenPin(clk.number)
        || !LPC24_Gpio_OpenPin(cmd.number)
        )
        return TinyCLR_Result::SharingViolation;

    LPC24_Gpio_ConfigurePin(d0.number, LPC24_Gpio_Direction::Input, d0.pinFunction, LPC24_Gpio_PinMode::PullUp);
    LPC24_Gpio_ConfigurePin(d1.number, LPC24_Gpio_Direction::Input, d1.pinFunction, LPC24_Gpio_PinMode::PullUp);
    LPC24_Gpio_ConfigurePin(d2.number, LPC24_Gpio_Direction::Input, d2.pinFunction, LPC24_Gpio_PinMode::PullUp);
    LPC24_Gpio_ConfigurePin(d3.number, LPC24_Gpio_Direction::Input, d3.pinFunction, LPC24_Gpio_PinMode::PullUp);
    LPC24_Gpio_ConfigurePin(clk.number, LPC24_Gpio_Direction::Input, clk.pinFunction, LPC24_Gpio_PinMode::Inactive);
    LPC24_Gpio_ConfigurePin(cmd.number, LPC24_Gpio_Direction::Input, cmd.pinFunction, LPC24_Gpio_PinMode::PullUp);

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    state->sectorSizes = (size_t*)memoryProvider->Allocate(memoryProvider, sizeof(size_t));

    if (!MCI_And_Card_initialize())
        return TinyCLR_Result::InvalidOperation;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_SdCard_Release(const TinyCLR_Storage_Controller* self) {
    auto state = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    auto controllerIndex = state->controllerIndex;

    auto d0 = sdCardData0Pins[controllerIndex];
    auto d1 = sdCardData1Pins[controllerIndex];
    auto d2 = sdCardData2Pins[controllerIndex];
    auto d3 = sdCardData3Pins[controllerIndex];
    auto clk = sdCardClkPins[controllerIndex];
    auto cmd = sdCardCmdPins[controllerIndex];

    LPC24XX::SYSCON().PCONP &= ~(1 << 28); /* Disable clock to the Mci block */

    LPC24XX::SYSCON().PCONP &= ~(1 << 29); /* Disable clock to the Dma block */

    LPC24_Interrupt_Deactivate(LPC24XX_VIC::c_IRQ_INDEX_SD); /* Disable Interrupt */

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    memoryProvider->Free(memoryProvider, state->sectorSizes);

    LPC24_Gpio_ClosePin(d0.number);
    LPC24_Gpio_ClosePin(d1.number);
    LPC24_Gpio_ClosePin(d2.number);
    LPC24_Gpio_ClosePin(d3.number);
    LPC24_Gpio_ClosePin(clk.number);
    LPC24_Gpio_ClosePin(cmd.number);

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_SdCard_GetControllerCount(const TinyCLR_Storage_Controller* self, int32_t& count) {
    count = SIZEOF_ARRAY(sdCardData0Pins);

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_SdCard_WriteSectors(const TinyCLR_Storage_Controller* self, uint64_t sector, size_t& count, const uint8_t* data, uint32_t timeout) {
    int32_t index = 0;

    int32_t to = timeout;

    auto sectorCount = count;

    auto sectorNum = sector;

    uint8_t* pData = (uint8_t*)data;

    while (sectorCount) {
        if (MCI_WriteSector(sectorNum, &pData[index]) == true) {
            index += LPC24_SD_SECTOR_SIZE;
            sectorNum++;
            sectorCount--;
        }
        else {
            return TinyCLR_Result::InvalidOperation;
        }
    }

    if (!to) {
        return TinyCLR_Result::TimedOut;
    }

