ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_SD.cpp
    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_SdCard_ReadSectors(const TinyCLR_Storage_Controller* self, uint64_t sector, size_t& count, uint8_t* data, uint32_t timeout) {
    int32_t index = 0;

    int32_t to = timeout;

    auto sectorCount = count;

    auto sectorNum = sector;

    while (sectorCount) {
        if (MCI_ReadSector(sectorNum, &data[index]) == true) {
            index += LPC24_SD_SECTOR_SIZE;
            sectorNum++;
            sectorCount--;
        }
        else {
            return TinyCLR_Result::InvalidOperation;
        }
    }

    if (!to) {
        return TinyCLR_Result::TimedOut;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_SdCard_IsSectorErased(const TinyCLR_Storage_Controller* self, uint64_t sector, bool& erased) {
    erased = true;
    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_SdCard_EraseSectors(const TinyCLR_Storage_Controller* self, uint64_t sector, size_t& count, uint32_t timeout) {
    uint32_t addressStart = sector * LPC24_SD_SECTOR_SIZE;

    uint32_t addressEnd = addressStart + (count * LPC24_SD_SECTOR_SIZE);

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_SdCard_GetSectorMap(const TinyCLR_Storage_Controller* self, const size_t*& sizes, size_t& count, bool& isUniform) {
    auto state = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    state->sectorSizes[0] = LPC24_SD_SECTOR_SIZE;

    sizes = state->sectorSizes;
    count = sdMediaSize / LPC24_SD_SECTOR_SIZE;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_SdCard_Reset() {
    return TinyCLR_Result::Success;
}
#endif // INCLUDE_SD